Revit 2018 API
ExportPatternTable.Item Property
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
public ExportPatternInfo this[
	ExportPatternKey patternKey
] { get; set; }
Visual Basic
Public Default Property Item ( _
	patternKey As ExportPatternKey _
) As ExportPatternInfo
	Get
	Set
Visual C++
public:
virtual property ExportPatternInfo^ default[ExportPatternKey^ patternKey] {
	ExportPatternInfo^ get (ExportPatternKey^ patternKey) sealed;
	void set (ExportPatternKey^ patternKey, ExportPatternInfo^ value) sealed;
}
Parameters
patternKey
Type: Autodesk.Revit.DB.ExportPatternKey
See Also
ExportPatternTable Class
Autodesk.Revit.DB Namespace